{
  "result": [
    {
      "value": "0.3S",
      "title": "Duck",
      "subtitle": "",
      "desc": "A true 'quick shot'! Ducks value 'foreplay' a lot. During the mating season, drakes will persistently surround the female ducks, waiting for a long time. If they can't wait, they'll 'forcefully take the bow.' After all, it only takes 0.3 seconds, ending before the female duck can react!",
      "pic": "https://pic.imgdb.cn/item/65745ed1c458853aef197db0.png"
    },
    {
      "value": "1S",
      "title": "Giraffe",
      "subtitle": "",
      "desc": "Giraffes are naturally hypertensive and cannot handle excitement. Mating involves vigorous movements, making it the most vulnerable time. Prolonged mating may lead to heart failure and make them easy prey for predators like lions. Hence, they have evolved into quick shooters. Giraffes also practice for mating in advance: same-sex riding.",
      "pic": "https://pic.imgdb.cn/item/6575554cc458853aeff1e935.png"
    },
    {
      "value": "1S",
      "title": "Yellow Warbler",
      "subtitle": "",
      "desc": "Yellow warblers exhibit mutual feeding after mating. Before mating, the female bird shakes its wings slightly next to the nest while making bird-like 'cheep cheep' sounds. The male bird promptly flies onto the female's back, grabbing the female's spine. After a moment of wing flapping, mating is complete.",
      "pic": "https://pic.imgdb.cn/item/65751432c458853aef0c0452.png"
    },
    {
      "value": "1.5S",
      "title": "Bee",
      "subtitle": "",
      "desc": "Male bees mate with the queen in flight. The queen closes her posterior, preventing the male bee from withdrawing. The queen rapidly flies to shake off the male bee, whose reproductive organs will break inside her, along with the tearing of internal organs, leading to death within 2 hours. The sperm is stored in the queen for future use.",
      "pic": "https://pic.imgdb.cn/item/6575bd50c458853aefd79c1d.png"
    },
    {
      "value": "2S",
      "title": "Pigeon",
      "subtitle": "",
      "desc": "Pigeons form lifelong couples for mating and raising offspring. During mating, the male pigeon opens its beak, and the female pigeon inserts her beak, engaging in regurgitation feeding. The female pigeon crouches, and the male pigeon jumps onto her back. The female pigeon tilts her tail upward, and the male pigeon presses down on the tail, flapping wings, with the cloacae making contact.",
      "pic": "https://pic.imgdb.cn/item/6575233ac458853aef3c11c0.png"
    },
    {
      "value": "3S",
      "title": "Squid",
      "subtitle": "",
      "desc": "Male squids use their beak-like mouth and sharp claws to puncture holes in the female's body, then inject sperm with a penis-like appendage. Some squids even use sperm to dig holes directly in the female's body. Their sperm contains an enzyme that can dissolve skin tissue.",
      "pic": "https://pic.imgdb.cn/item/6575c314c458853aeffe2560.png"
    },
    {
      "value": "3S",
      "title": "Swift",
      "subtitle": "",
      "desc": "Mating while flying! Swifts typically maintain body stability in the sky with a gliding posture during mating. When the time is right, two swifts make contact with their cloacae and then glide together for a distance.",
      "pic": "https://pic.imgdb.cn/item/65753cb2c458853aef94d622.png"
    },
    {
      "value": "3S",
      "title": "Tibetan Antelope",
      "subtitle": "",
      "desc": "Due to high-altitude hypoxia, time must be shortened. Male antelopes may engage in combat for mating rights, with the winner gaining the right to mate. Before mating, the male antelope dances in salute. The mating time is short but frequent, occurring more than a dozen times a day for seven consecutive days.",
      "pic": "https://pic.imgdb.cn/item/6575be56c458853aefdfacb7.png"
    },
    {
      "value": "5S",
      "title": "Chicken",
      "subtitle": "",
      "desc": "The rooster holds the hen's comb, forcing her to lie down. Finally, the hen's tail opens, pointing upward, revealing the genitalia. The rooster's tail spreads, covering the vent, and the cloaca is fully turned inside the hen's cloaca. The entire mating process is blocked by the rooster's tail.",
      "pic": "https://pic.imgdb.cn/item/6575bee0c458853aefe3cd08.png"
    },
    {
      "value": "5S",
      "title": "Sloth",
      "subtitle": "",
      "desc": "Males leave scent marks on trees to indicate their location, while females make sounds to call males: come and play, everything is ready! Multiple males rush in, leading to fights for a mate. After mating, the male sloth leaves to find other females.",
      "pic": "https://pic.imgdb.cn/item/6575bf4cc458853aefe6f0b5.png"
    },
    {
      "value": "12S",
      "title": "Eagle",
      "subtitle": "",
      "desc": "Before mating, the female eagle flies into the sky, while the male eagles circle around her. The female eagle selects the strongest and most beautiful male eagle to spend her life with. Once the female eagle chooses a mate, the other male eagles fly away. Only the pair of eagles dance in courtship in the sky.",
      "pic": "https://pic.imgdb.cn/item/657561f2c458853aef259a44.png"
    },
    {
      "value": "15S",
      "title": "Swan",
      "subtitle": "",
      "desc": "Swans often mate in water. Using buoyancy, the male swan flaps its wings to climb onto the back of the female swan. At this moment, the female swan bends its neck forward, dips its beak into the water, raises its tail, and exposes the cloaca above the water surface, aligning it with the male's copulatory organ to swiftly complete the ejaculation process.",
      "pic": "https://pic.imgdb.cn/item/6575625dc458853aef289ecd.png"
    },
    {
      "value": "15S",
      "title": "Mosquito",
      "subtitle": "",
      "desc": "Male mosquitoes grab the hind legs of female mosquitoes with their front legs, holding them like a pole and swinging them under the abdomen of the female mosquito. In less than a second, the male mosquito's copulatory organ connects with the female mosquito's abdomen. Afterward, the connected mosquitoes mate in the air and gradually fly out of the swarm.",
      "pic": "https://pic.imgdb.cn/item/657666d8c458853aefda1658.png"
    },
    {
      "value": "18S",
      "title": "Rabbit",
      "subtitle": "",
      "desc": "Upon detecting the scent of the female rabbit, the male rabbit chases her slightly. The female rabbit willingly complies, lying down for the male rabbit to climb onto her hindquarters. The male rabbit rubs the side of the female rabbit's abdomen with its front paws. When the male rabbit's hindquarters curve forward, and it makes a 'gulping' sound, indicating ejaculation, the mating is complete.",
      "pic": "https://pic.imgdb.cn/item/6575bf95c458853aefe93ff7.png"
    },
    {
      "value": "18S",
      "title": "Bonobo",
      "subtitle": "",
      "desc": "Bonobos engage in various mating positions, including kissing, the missionary position, and the 'old man pushing a cart.' Males may masturbate and use their genitals like 'bayonets,' while females mutually touch their genitalia. Bonobos are highly promiscuous, mating throughout the year. They use sex to greet, apologize, and request extra food.",
      "pic": "https://pic.imgdb.cn/item/6576a23ec458853aef78f8e1.jpg"
    },
    {
      "value": "20S",
      "title": "Blue Whale",
      "subtitle": "",
      "desc": "Blue whales possess the largest penis in the animal kingdom, reaching around 3 meters. Normally concealed, the penis pops out during mating, emerging from the genital slit. It is more robust compared to the penises of other mammals. The female whale also has a slit, and the male whale probes with its penis, much like using a hand.",
      "pic": "https://pic.imgdb.cn/item/657683afc458853aef231cb1.jpg"
    },
    {
      "value": "20S",
      "title": "Dolphin",
      "subtitle": "",
      "desc": "Once a male dolphin is in heat, it spends the entire day among a group of female dolphins, showcasing its talents to attract mates. If a female rejects the male's courtship, the male dolphin may ram and vigorously slap with its fins, forcing the female dolphin to accept. Male dolphins may form alliances to coerce mating with female dolphins.",
      "pic": "https://pic.imgdb.cn/item/6575c069c458853aefee6499.png"
    },
    {
      "value": "25S",
      "title": "Tiger",
      "subtitle": "",
      "desc": "Tigers are known as 'quick shooters' but mate frequently during the mating season. The total count during estrus can reach over a hundred times, significantly increasing the chances of the female tiger getting pregnant. The spines on the tiger's penis are for scraping out semen, stimulating ovulation. Male tigers must dominate female tigers, or they may fight.",
      "pic": "https://pic.imgdb.cn/item/6575c68cc458853aef164b0c.png"
    },
    {
      "value": "30S",
      "title": "Lion",
      "subtitle": "",
      "desc": "The penis of the male lion has barbs that stimulate ovulation in the female lion and can also disrupt the semen of a previous male, ensuring that the cubs are his own. The female lion experiences significant pain during mating and retaliates against the male lion, often beating him after copulation.",
      "pic": "https://pic.imgdb.cn/item/6576c040c458853aefd3e118.png"
    },
    {
      "value": "1M",
      "title": "Ostrich",
      "subtitle": "",
      "desc": "The female ostrich flutters its wings and makes honking sounds. It lies down, with wings closed. The male ostrich places its right leg on the female's back, kneels its left leg on the ground, inserts its penis into the female's cloaca from the left side, and continues to vigorously strike the sides of her back with its head. The female raises her head and swings back and forth.",
      "pic": "https://pic.imgdb.cn/item/657562e3c458853aef2c3f8d.png"
    },
    {
      "value": "1M",
      "title": "Squirrel",
      "subtitle": "",
      "desc": "When male squirrels compete for mates, some take advantage of fights between other males, secretly mating with the female squirrel. Others wait near the female squirrel's nest. The male squirrel's semen solidifies into a gel-like plug inside the female's vagina, preventing her from mating with other males.",
      "pic": "https://pic.imgdb.cn/item/6576c0d1c458853aefd5683d.jpg"
    },
    {
      "value": "1M",
      "title": "Cheetah",
      "subtitle": "",
      "desc": "The female cheetah releases specific chemical signals to attract males. Once a male catches up, it jumps onto the female's back, grabs the female's neck with its front legs, and mates. Cheetahs have relatively short mating intervals, often engaging in multiple matings within a short period to increase the chances of conception.",
      "pic": "https://pic.imgdb.cn/item/6576c16ec458853aefd70ecb.jpg"
    },
    {
      "value": "1.5M",
      "title": "Gorilla",
      "subtitle": "",
      "desc": "Male gorillas exhibit muscle swelling, perform displays, and make specific calls to attract females. There is foreplay, including mutual touching, kissing, and hugging. Gorillas mate in a back-to-back position, with the male standing behind the female, holding the female's hips, and then engaging in intercourse.",
      "pic": "https://pic.imgdb.cn/item/6576c3eac458853aefdecdf8.jpg"
    },
    {
      "value": "1.5M",
      "title": "Horse",
      "subtitle": "",
      "desc": "The male horse exhibits increased activity, emitting calls, raising its head, puffing its chest, and kicking its legs to attract the female horse. The male circles around the female, engaging in a 'circle dance.' Then, it bites the neck of the female horse, arousing her excitement. The female horse stops, and the male horse, using its front legs, grabs the back of the female horse to initiate mating.",
      "pic": "https://pic.imgdb.cn/item/6575c2adc458853aeffb6f19.png"
    },
    {
      "value": "1.6M",
      "title": "Koala",
      "subtitle": "",
      "desc": "The koala's penis is Y-shaped and bifurcated. Females have 2 vaginas and 2 uteri, and the bifurcated penis of males adapts to this structure, allowing sperm to be transported to both uteri. Females excel in recognizing mates through vocalizations, using sounds to determine if the approaching koala is a suitable partner.",
      "pic": "https://pic.imgdb.cn/item/657646ebc458853aef9f7c73.png"
    },
    {
      "value": "2M",
      "title": "Elephant",
      "subtitle": "",
      "desc": "The male elephant climbs onto the back of the female elephant, which stands still. The male stands on its hind legs behind the female, nearly vertically. Using its trunk, the male caresses the head and ears of the female, initiating mating. Female elephants reach sexual maturity at 10-12 years, while males mature at 20. Young males must compete with middle-aged males.",
      "pic": "https://pic.imgdb.cn/item/6576c5b1c458853aefe426f3.jpg"
    },
    {
      "value": "2M",
      "title": "Elephant Beetle",
      "subtitle": "",
      "desc": "Male elephant beetles have frightening spines on their reproductive organs, with the size of these spines affecting their chances of winning in 'arms races.' Larger, sharper spines often attract females more and facilitate mating. Females experience pain but gain hydration from the semen.",
      "pic": "https://pic.imgdb.cn/item/657a6232c458853aeff39b8c.jpg"
    },
    {
      "value": "3M",
      "title": "Penguin",
      "subtitle": "",
      "desc": "The male penguin lowers its head, approaches the female, and the female comes closer. They caress each other with the tips of their wings, and the male positions its chin on the female's head. The male climbs onto the back of the female, and the female lifts its tail. The two penguins press their cloacas together.",
      "pic": "https://pic.imgdb.cn/item/6575633dc458853aef2e2740.png"
    },
    {
      "value": "3M",
      "title": "Cat",
      "subtitle": "",
      "desc": "The male cat has spines on its genitalia to remove the semen of other males from the female cat's body. To prevent the female cat from escaping due to pain, the male cat bites the back of the female's neck. When the female suddenly turns around to bite or scratch the male cat, it signifies the end of mating. Female cats may mate multiple times.",
      "pic": "https://pic.imgdb.cn/item/6576c7a1c458853aefea0034.png"
    },
    {
      "value": "3M",
      "title": "Cow",
      "subtitle": "",
      "desc": "The male bull jumps up on its front legs, supporting its body with its hind legs, and leans onto the back of the female cow. Mating begins. Female cows typically accept mating during estrus, and the male bull's performance and health influence the success and duration of mating. Artificial insemination is the most common method for cattle mating.",
      "pic": "https://pic.imgdb.cn/item/6576c623c458853aefe57999.jpg"
    },
    {
      "value": "3M",
      "title": "Giant Panda",
      "subtitle": "",
      "desc": "Giant pandas have a very short mating season, often lasting only 2-3 days, sometimes just 2 hours. When the female panda's hormones decline, it no longer cooperates for mating, making conception challenging. Only mutually attracted pandas can complete mating; otherwise, they might fight.",
      "pic": "https://pic.imgdb.cn/item/65764658c458853aef9e9a0a.png"
    },
    {
      "value": "3M",
      "title": "Anteater",
      "subtitle": "",
      "desc": "Anteaters and platypuses are both egg-laying mammals. The male anteater has four glans on its reproductive organ, alternating their use during mating, employing two at a time. By contracting two and expanding two, the male enters the bifurcated reproductive tract of the female anteater. Male anteaters queue, awaiting selection by the female for mating.",
      "pic": "https://pic.imgdb.cn/item/657c4ccec458853aef9eac26.png"
    },
    {
      "value": "3M",
      "title": "Mouse",
      "subtitle": "",
      "desc": "Male mice chase female mice, and the female emits squeaks. The male lies on top of the female, arching its body. Sometimes, the female may struggle to climb out, but once the male is in this position, it obediently 'submits.' The male mouse transfers sperm to the female through its reproductive organ.",
      "pic": "https://pic.imgdb.cn/item/6575c222c458853aeff7b703.png"
    },
    {
      "value": "3.8M",
      "title": "Bat",
      "subtitle": "",
      "desc": "Bats can emit ultrasonic waves to find partners, and most bats mate during nighttime flights. The penis of the male big brown bat is seven times longer than the vagina of the female, with a heart-shaped head seven times wider than the vaginal opening. It serves as a support arm, lifting the female's tail to engage in contact-style mating similar to birds.",
      "pic": "https://pic.imgdb.cn/item/657645d3c458853aef9dc345.png"
    },
    {
      "value": "5M",
      "title": "Frog",
      "subtitle": "",
      "desc": "Male frogs produce mating calls. Frog mating typically occurs in an amplexus position, promoting ovulation. The male jumps onto the female's back, using specialized thumb-like forelimbs to grasp the female. This helps ensure the successful release of sperm onto the female's eggs.",
      "pic": "https://pic.imgdb.cn/item/657bd6d5c458853aefd1198b.png"
    },
    {
      "value": "5M",
      "title": "Dragonfly",
      "subtitle": "",
      "desc": "Male dragonflies use their abdominal end to grasp the posterior head or anterior thorax of the female. The female bends its abdomen upward, allowing the genitalia at the end of the abdomen to connect with the male's genitalia, forming a heart shape. This structure receives and stores sperm for later egg-laying. Male dragonflies are often forceful in their approach.",
      "pic": "https://pic.imgdb.cn/item/657c4db8c458853aefa30e25.png"
    },
    {
      "value": "6M",
      "title": "Human",
      "subtitle": "",
      "desc": "Human sexual intercourse is not just for reproduction but also for enjoying marital life. There are various positions such as pushing the cart, sitting on the lotus, 69, missionary, riding, propeller, triumphal arch, lateral entry, sphinx, Kama Sutra, eagle, waterfall, spider, goddess, V-shape, and more. Can you master 100 positions?",
      "pic": "https://pic.imgdb.cn/item/6576c73cc458853aefe8cf40.jpg"
    },
    {
      "value": "8M",
      "title": "Crocodile",
      "subtitle": "",
      "desc": "Crocodiles mate in water; the male's penis is inside the cloaca when not mating. During mating, it extends and can penetrate the female's reproductive tract. Male crocodiles don't seek consent; they directly flip the female over and proceed with mating in a frenzied manner.",
      "pic": "https://pic.imgdb.cn/item/6575c4c4c458853aef0a2af6.png"
    },
    {
      "value": "10M",
      "title": "Hedgehog",
      "subtitle": "",
      "desc": "Contrary to popular belief that hedgehogs mate belly to belly due to their spines, male hedgehogs climb onto the female's back. The female retracts the spines on its back, reducing harm to the male hedgehog. The rest depends on the male hedgehog enduring the situation.",
      "pic": "https://pic.imgdb.cn/item/6575c473c458853aef076e3d.png"
    },
    {
      "value": "10M",
      "title": "Bedbug",
      "subtitle": "",
      "desc": "Bedbugs lack a courtship ritual; they engage in traumatic insemination. The male rides on the female, and its penis pierces the female's body, injecting sperm into the abdomen. The sperm disperses through the blood to the ovaries. Females evolved spermalege to minimize damage at the piercing site.",
      "pic": "https://pic.imgdb.cn/item/657a590ec458853aefd91737.jpg"
    },
    {
      "value": "14M",
      "title": "Wolf",
      "subtitle": "",
      "desc": "Male wolves howl to attract females and use chemical substances in urine to mark territory, conveying information to other wolves. Once two wolves establish a mating interaction, they chase, play, and engage in close contact. When interested in each other, they initiate mating.",
      "pic": "https://pic.imgdb.cn/item/6576c88fc458853aefec7261.png"
    },
    {
      "value": "15M",
      "title": "Octopus",
      "subtitle": "",
      "desc": "Male octopuses use a special tentacle called a 'hectocotylus' for mating, injecting sperm directly into the female octopus's mantle. After mating, the male octopus enters a senescent phase and rapidly dies, while the female octopus also dies shortly after hatching fertilized eggs.",
      "pic": "https://pic.imgdb.cn/item/6576c8fbc458853aefeda337.jpg"
    },
    {
      "value": "15M",
      "title": "Platypus",
      "subtitle": "",
      "desc": "Platypus and echidnas are the only two egg-laying mammals on Earth. Platypuses engage in courtship by biting each other's tails. During mating, the female raises its tail, and the male, biting the female's neck for balance, accurately aligns the cloaca's reproductive openings.",
      "pic": "https://pic.imgdb.cn/item/657c5af5c458853aefecd14b.png"
    },
    {
      "value": "20M",
      "title": "Fox",
      "subtitle": "",
      "desc": "The mating process of foxes typically occurs in winter or spring. During the mating season, male and female foxes demonstrate interest through calls, postures, and chemical exchanges. Courting behaviors include chasing each other and intimate contact. Once a suitable mate is identified, they engage in brief and frequent mating.",
      "pic": "https://pic.imgdb.cn/item/6576c973c458853aefef128d.png"
    },
    {
      "value": "20M",
      "title": "Pig",
      "subtitle": "",
      "desc": "Pigs are widely recognized for having the longest mating orgasm among animals, ensuring both duration and quality. When a sow is in heat, she makes specific grunting sounds and raises her hindquarters. Attracted boars then mount the sow's back and perform thrusting movements. Pig mating often involves artificial insemination.",
      "pic": "https://pic.imgdb.cn/item/657665fac458853aefd81b3c.jpg"
    },
    {
      "value": "20M",
      "title": "Dog",
      "subtitle": "",
      "desc": "During mating, the male dog's genitalia opens at the front, securing itself inside the female. This is called a tie, which increases the breeding success rate, ensuring the sperm and egg's binding without interference from other male dogs later on. The process is painful for female dogs.",
      "pic": "https://pic.imgdb.cn/item/6576c81bc458853aefeb36a6.jpg"
    },
    {
      "value": "20M",
      "title": "Kangaroo",
      "subtitle": "",
      "desc": "Female kangaroos have 2 uteri and 3 vaginas, while male kangaroos have a Y-shaped bifurcated penis. The male kangaroo uses its front limbs to embrace the female from behind, completing mating with the female's cooperation. During pregnancy, a female kangaroo can nurture two joeys simultaneously, one in the uterus and another in the pouch.",
      "pic": "https://pic.imgdb.cn/item/6575c36bc458853aef00a299.png"
    },
    {
      "value": "25M",
      "title": "Bear",
      "subtitle": "",
      "desc": "Bear mating typically occurs in spring or summer. Male bears communicate with female bears through roars, calls, and urine. Courting behaviors include playful interactions, pawing the ground, and shaking heads. Once interest is established, the male bear climbs onto the female's back to complete the mating process.",
      "pic": "https://pic.imgdb.cn/item/6576c9dcc458853aeff0263b.jpg"
    },
    {
      "value": "30M",
      "title": "Hippopotamus",
      "subtitle": "",
      "desc": "Hippopotamus mating usually takes place in water, where the male hippo swims near the female. Specific sounds are emitted as the male pursues the female in the water, conveying courtship signals through unique swimming movements. The male hippo initiates intimate behavior by touching the female with its mouth or head before mating begins.",
      "pic": "https://pic.imgdb.cn/item/6576ca9dc458853aeff21035.png"
    },
    {
      "value": "30M",
      "title": "Seal",
      "subtitle": "",
      "desc": "Seal mating typically occurs on beaches. Male seals chase females, displaying courtship actions such as rolling, swinging their heads, emitting specific calls, and engaging in physical contact. During mating, males and females closely connect their reproductive organs at the shore. Seal mating poses a risk of crushing pups.",
      "pic": "https://pic.imgdb.cn/item/65764772c458853aefa0a1dd.png"
    },
    {
      "value": "30M",
      "title": "Wolf Spider",
      "subtitle": "",
      "desc": "Wolf spider mating usually takes place in spring. Male spiders attract females by vibrating silk threads. After the female responds, the male approaches and touches the female's abdomen. The male transfers a sperm packet to the female, who collects and stores it. The female then constructs a web and places the egg sac within it.",
      "pic": "https://pic.imgdb.cn/item/6575c41cc458853aef052620.png"
    },
    {
      "value": "45M",
      "title": "Scorpion",
      "subtitle": "",
      "desc": "Male scorpions use antennae to touch the female, simultaneously releasing chemicals to confirm the female's willingness to mate. If the female responds positively, the male scorpion twists its back and transfers a sperm packet to the female. The female collects the sperm packet in the reproductive opening, completing the mating process.",
      "pic": "https://pic.imgdb.cn/item/65766358c458853aefd1e51d.jpg"
    },
    {
      "value": "50M",
      "title": "Ladybug",
      "subtitle": "",
      "desc": "The male climbs onto the back of the female ladybug, assuming a mating position. The female usually extends her abdomen, providing a suitable location for the male. The male ladybug uses its genitalia to transfer sperm to the female. Some ladybugs release stimulating chemicals during mating to prevent interference from other males.",
      "pic": "https://pic.imgdb.cn/item/65765eb6c458853aefc738c2.png"
    },
    {
      "value": "1H",
      "title": "Flatworm",
      "subtitle": "",
      "desc": "Flatworms have both testes and ovaries and possess two short, sword-like penises. They engage in mating by sword-fighting with their penises. Both parties attempt to stab each other beneath the skin to release sperm. After the battle, the loser accepts the winner's sperm, becoming the 'mother.'",
      "pic": "https://pic.imgdb.cn/item/657a6530c458853aeffe8aee.jpg"
    },
    {
      "value": "2H",
      "title": "Sea Slug",
      "subtitle": "",
      "desc": "Sea slugs are hermaphroditic, engaging in reciprocal mating. Groups of a dozen or more sea slugs form mating chains, adjusting their direction after a while. Group mating can last for several hours and, in some cases, even days.",
      "pic": "https://pic.imgdb.cn/item/657a7dc9c458853aef55f68b.png"
    },
    {
      "value": "3H",
      "title": "King Cobra",
      "subtitle": "",
      "desc": "The male cobra climbs onto the female's back, assuming a unique mating position. The male's body wraps around the female, allowing effective contact of reproductive organs. The male snake tightly entwines its tail with the female's to prevent slipping. Male cobras have two spiky hemipenes.",
      "pic": "https://pic.imgdb.cn/item/657656f2c458853aefb9f36a.png"
    },
    {
      "value": "3H",
      "title": "Triple Connected People",
      "subtitle": "",
      "desc": "Each 'like' adds 1 hour, each 'coin' adds 1 hour, and each 'bookmark' adds 1 hour. Comments will persist for 3 hours, and even at the age of 70, a repost can still contribute 3 hours. It's a rollercoaster of unpredictable twists and turns, a continuous orgasm.",
      "pic": "https://pic.imgdb.cn/item/6576d621c458853aef121b3e.png"
    },
    {
      "value": "6H",
      "title": "Snail",
      "subtitle": "",
      "desc": "Snails are hermaphroditic, and determining which individual plays the role of 'father' or 'mother' involves a duel. Snails carry a concealed weapon, a hardened and sharp dart, in their abdomens, known as the 'arrow of love.' They harm each other, and both snails receive sperm from the other. The victor kills the sperm donor, becoming the 'father,' while the loser accepts the sperm, becoming the 'mother.'",
      "pic": "https://pic.imgdb.cn/item/65764eddc458853aefaba820.png"
    },
    {
      "value": "6H",
      "title": "Praying Mantis",
      "subtitle": "",
      "desc": "Female praying mantises eat the male after mating purely out of hunger; scientific experiments have shown that well-fed female mantises refrain from cannibalism. Even with its head bitten off, the male can complete the mating process, as the mantis's nervous system is distributed across different body parts.",
      "pic": "https://pic.imgdb.cn/item/657647e4c458853aefa17e6c.png"
    },
    {
      "value": "8H",
      "title": "Stoat",
      "subtitle": "",
      "desc": "To compete for mating rights, male stoats display their strength and bravery. Extended mating durations may serve as a territorial control method, eliminating other competing males by consuming more time. Simultaneously, it ensures an adequate number of fertilization instances, increasing the offspring's quantity.",
      "pic": "https://pic.imgdb.cn/item/65764ba7c458853aefa727f2.png"
    },
    {
      "value": "14H",
      "title": "Broad-footed Marsupial Mouse",
      "subtitle": "",
      "desc": "Numerous male broad-footed marsupial mice sacrifice themselves in battles to secure mates. During the mating season, males continuously secrete testosterone, becoming aggressive and mating with multiple females. Elevated testosterone levels persist, leading to the death of many males. This is truly a 'deathly reproduction.'",
      "pic": "https://pic.imgdb.cn/item/65764b08c458853aefa64a07.png"
    },
    {
      "value": "24H",
      "title": "Sea Turtle",
      "subtitle": "",
      "desc": "The male turtle lies completely still on the female turtle's shell. The female swims with the male attached, engaging in rolling and rotating movements. The male turtle possesses a pair of S-shaped genitalia, short and horn-like tails, known as 'tail extensions.' Sea turtles have a relatively internalized reproductive organ structure.",
      "pic": "https://pic.imgdb.cn/item/6576493ec458853aefa38ae9.png"
    },
    {
      "value": "30H",
      "title": "Paper Nautilus Octopus",
      "subtitle": "",
      "desc": "The male has specialized arm-like structures, called hectocotylus, to transfer sperm to the female. The hectocotylus inserts into the female's mantle cavity, detaching afterward. Scholars initially mistook the mating arm for a parasite. Males can mate only once in their short lives.",
      "pic": "https://pic.imgdb.cn/item/657648dbc458853aefa2f829.png"
    },
    {
      "value": "Lifetime",
      "title": "Anglerfish",
      "subtitle": "",
      "desc": "Male anglerfish parasitize multiple individuals of the same female. The male's body tissues are absorbed by the female! Eyes, internal organs, and other organs gradually degenerate, being absorbed by the female's body, leaving only reproductive organs: the sperm sac. This is known as sexual fusion. It increases reproductive success in the deep sea.",
      "pic": "https://pic.imgdb.cn/item/657547d1c458853aefbd5de1.png"
    }
  ]
}